package com.icourt.parse.analysis.abs;

import com.icourt.parse.analysis.Analysis;

/**
 * 公安部过滤
 */
public abstract class AbstractPubFilter implements Analysis {

    @Override
    public String checkContentToPick() {
        return ".*(个人信息|网络安全|隐私|携号转网|数据安全|敏感权限|App|应用程序|互联网安全|信息安全|未成年个人信息|教育信息|信息泄露|敏感信息|系统安全|黑客|网络信息犯罪|净网行动).*";
    }

    @Override
    public String checkContentToNotPick() {
        return ".*(遴选|比赛|竞赛|党建|党史|扶贫|座谈会|招聘|面试|继续教育|禁毒|驾车|教育|会议|思想|跳楼|表彰|迷路|消防|自杀|救援|代驾|祖国|吸毒|杀人|交通|出行|天气|火灾|醉酒|见义勇为|热心|交警|和谐|贼|短信|酒驾|高温|偷|抢劫|春节|强奸|台风|暴雨|洪水|爆炸|代表|盗窃|贩毒|毒品|走访|监控|衣服|防盗|车祸|追尾|婚礼|结婚|烟花|食品|环境|卫生|化学|垃圾|打架|殴打|寻衅|滋事|赌博|仿制|淫|流动|伤害|扰乱|住宅|入户|出境|入境|伪造|侮辱|陪侍|虐待|赃物|犬|狗|正常生活|危险物质|财物|故意伤害|妨害公务|伪造|排放污染物|阻碍执行职务|紧急状态).*";
    }

    @Override
    public String checkTitleToPick() {
        return ".*(执法|信息|通报|App|应用软件|检测|约谈|个人信息|治理|网络安全|数据安全|整治|处罚|查处|通告|违法|隐私 |个人数据|敏感数据).*";
    }

    @Override
    public String checkTitleToNotPick() {
        return ".*(遴选|比赛|竞赛|党建|党史|扶贫|座谈会|招聘|面试|继续教育|禁毒|驾车|教育|会议|思想|跳楼|表彰|迷路|消防|自杀|救援|代驾|祖国|吸毒|杀人|交通|出行|天气|火灾|醉酒|见义勇为|热心|交警|和谐|贼|短信|酒驾|高温|偷|抢劫|春节|强奸|台风|暴雨|洪水|爆炸|代表|盗窃|贩毒|毒品|走访|监控|衣服|防盗|车祸|追尾|婚礼|结婚|烟花|食品|环境|卫生|化学|垃圾|打架|殴打|寻衅|滋事|赌博|仿制|淫|流动|伤害|扰乱|住宅|入户|出境|入境|伪造|侮辱|陪侍|虐待|赃物|犬|狗|正常生活|危险物质|财物|故意伤害|妨害公务|伪造|排放污染物|阻碍执行职务|紧急状态).*";
    }

    @Override
    public String mainBody() {
        return "公安部";
    }
}
